In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
revenue_series =Series([100,200,300,np.nan], index =['Audi','BMW','Honda','Toyota'])
print(revenue_series)

Audi      100.0
BMW       200.0
Honda     300.0
Toyota      NaN
dtype: float64

In [4]:
revenue_series.isnull()

Audi      False
BMW       False
Honda     False
Toyota     True
dtype: bool

In [5]:
revenue_series.dropna()

Audi     100.0
BMW      200.0
Honda    300.0
dtype: float64

In [6]:
# Dataframe drop (dropna)

df1 =DataFrame(np.random.randn(12).reshape(4,3))
print(df1)

          0         1         2
0  0.138361  1.053601 -0.594564
1  0.189149  0.133341 -0.298680
2 -0.451798 -0.510105  0.746580
3 -1.397985 -0.732146 -1.505445

In [8]:
df1.loc[1,2] =np.nan
df1.loc[2,1]=np.nan
 
print(df1)

          0         1         2
0  0.138361  1.053601 -0.594564
1  0.189149  0.133341       NaN
2 -0.451798       NaN  0.746580
3 -1.397985 -0.732146 -1.505445

In [9]:
df1.dropna()

          0         1         2
0  0.138361  1.053601 -0.594564
3 -1.397985 -0.732146 -1.505445

In [10]:
# Disadvantages of droping all the NA values in a dataframes
df1.dropna(how ='all')

          0         1         2
0  0.138361  1.053601 -0.594564
1  0.189149  0.133341       NaN
2 -0.451798       NaN  0.746580
3 -1.397985 -0.732146 -1.505445

In [11]:
# Data frame =dropna(columns)
df1.dropna(axis=1)

          0
0  0.138361
1  0.189149
2 -0.451798
3 -1.397985

In [14]:
# Dropna with a thresh parameter
df2 = DataFrame([[1,2,3,np.nan],
                [4,5,6,7],
                [8,9,np.nan,np.nan]
                ,[12,np.nan,np.nan,np.nan]
                ])
print(df2)

    0    1    2    3
0   1  2.0  3.0  NaN
1   4  5.0  6.0  7.0
2   8  9.0  NaN  NaN
3  12  NaN  NaN  NaN

In [15]:
df2.dropna(thresh=3)

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  5.0  6.0  7.0

In [16]:
# Fill Na function
df2.fillna(0)

    0    1    2    3
0   1  2.0  3.0  0.0
1   4  5.0  6.0  7.0
2   8  9.0  0.0  0.0
3  12  0.0  0.0  0.0

In [17]:
# Fill functions using dictionery

df2.fillna({0:0,1:50,2:100,3:200})

    0     1      2      3
0   1   2.0    3.0  200.0
1   4   5.0    6.0    7.0
2   8   9.0  100.0  200.0
3  12  50.0  100.0  200.0